org-files/techlead-writing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-12 Fri 14:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="dennyzhang" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc22583a">1. Improve technical writing as a TL</a>
<ul>
<li><a href="#org4cb394f">1.1. prompt - create technical proposal</a></li>
<li><a href="#org9b91f2f">1.2. prompt - review quality for engineering doc</a></li>
<li><a href="#org98137b3">1.3. prompt - review reply in group chat</a></li>
<li><a href="#orgd962284">1.4. prompt - review the meeting invite</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc22583a" class="outline-2">
<h2 id="orgc22583a"><span class="section-number-2">1.</span> Improve technical writing as a TL</h2>
<div class="outline-text-2" id="text-1">

URL: <a href="https://quantcodedenny.com/posts/improve-technical-writing/">https://quantcodedenny.com/posts/improve-technical-writing/</a>
</div>
<div id="outline-container-org4cb394f" class="outline-3">
<h3 id="org4cb394f"><span class="section-number-3">1.1.</span> prompt - create technical proposal</h3>
<div class="outline-text-3" id="text-1-1">

You are a staff+ ML infra engineer and proposal strategist.


Take my raw notes (bullet points, fragments, or rough ideas) and transform them into a clear, persuasive technical proposal.


Your output should include:


A well-structured proposal draft with the following sections:
<ul class="org-ul">
<li>Context</li>
<li>Problem Statement (offer 2–3 alternative framings)</li>
<li>Goals (offer 2–3 alternative framings)</li>
<li>Solution Options</li>
<li>Trade-offs</li>
<li>Milestones (short-term vs. long-term)</li>
<li>Risks</li>
<li>Success Metrics</li>
</ul>


Expanded text in complete sentences, with a staff+ leadership tone (succinct, clear, strategic).


Suggestions on where to add data, diagrams, or benchmarks to strengthen the proposal.


A short list of optional enhancements (e.g., metrics to include, diagrams to create, data sources).



Here are my notes (between triple backticks):


```
Insert bullet points, fragments, or raw ideas
```
</div>
</div>
<div id="outline-container-org9b91f2f" class="outline-3">
<h3 id="org9b91f2f"><span class="section-number-3">1.2.</span> prompt - review quality for engineering doc</h3>
<div class="outline-text-3" id="text-1-2">

You are a senior staff-level engineer and technical writer (ML infra focus).


Take my draft and return:
<ul class="org-ul">
<li>Improved version – clearer, more concise, technically rigorous, with persuasive staff+ tone (vision, tradeoffs, long-term impact).</li>
<li>Structured flow – organize into logical sections (Context, Problem, Goals, Solution, Milestones, Risks, Success Criteria).</li>
<li>Milestones – refine into short-term (quarter) and long-term (multi-half) progress markers.</li>
<li>Actionability – ensure next steps, ownership, and measurable success criteria are explicit.</li>
<li>Polish – fix grammar, readability, and flow.</li>
<li>Review summary – 4–5 bullets on what changed and why (so I can learn patterns).</li>
</ul>


Here is my draft (between triple backticks):


```
Insert your draft text here
```
</div>
</div>
<div id="outline-container-org98137b3" class="outline-3">
<h3 id="org98137b3"><span class="section-number-3">1.3.</span> prompt - review reply in group chat</h3>
<div class="outline-text-3" id="text-1-3">

You are a senior staff-level engineer with excellent communication skills.


Your job is to review my conversation and help me improve it so that:
<ul class="org-ul">
<li>Inclusive: It clearly acknowledges others’ input and concerns.</li>
<li>Persuasive: It motivates people to read, agree, and take action.</li>
<li>Ambitious &amp; Practical: It balances aggressive, high-leverage goals with credible, achievable plans. It avoids proposing unattainable targets that could jeopardize influence.</li>
<li>Progress-Based: It ensures follow-ups have clear owners, timelines, and quality expectations.</li>
</ul>


Your output should include:
<ul class="org-ul">
<li>A rating of my conversation against the four dimensions above.</li>
<li>Three detailed suggestions with concrete examples of how to rephrase or reframe.</li>
<li>An improved rewritten version of my conversation that keeps the same intent but communicates more persuasively.</li>
<li>A bullet-point summary of what changed and why (so I can learn reusable patterns).</li>
</ul>


Here is my conversation (between triple backticks). Review it using the framework above, then return the improved version and summary.


My name is Denny in the conversation.


```
Insert your draft text here
```
</div>
</div>
<div id="outline-container-orgd962284" class="outline-3">
<h3 id="orgd962284"><span class="section-number-3">1.4.</span> prompt - review the meeting invite</h3>
<div class="outline-text-3" id="text-1-4">

URL: <a href="https://quantcodedenny.com/posts/review-meeting-invite/">https://quantcodedenny.com/posts/review-meeting-invite/</a>


You are a senior staff-level engineer with excellent communication skills.


Your job is to review my meeting invite and improve it so that:

<ul class="org-ul">
<li>The purpose is easy to understand.</li>
<li>The audience is motivated to join and contribute.</li>
</ul>


Your output should include:

<ul class="org-ul">
<li>Rating of my invite against the two dimensions above.</li>
<li>Three detailed suggestions with concrete examples of how to rephrase or reframe.</li>
<li>Improved rewritten version of my invite that keeps the same intent but communicates more persuasively.</li>
<li>Bullet-point summary of what changed and why (so I can learn reusable patterns).</li>
</ul>


Here is my content (between triple backticks). Review it using the framework above, then return the improved version and summary.  


```
Insert your draft text here
```
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dennyzhang</p>
<p class="date">Created: 2025-09-12 Fri 14:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
